# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'telnet'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached


# Development
brew 'libmemcached'
brew 'memcached'
# brew 'mysql'
brew 'nginx'
# brew 'redis'
brew 'yarn'

# Apps
cask 'brackets'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'jetbrains-toolbox'
cask 'microsoft-teams'
cask 'slack'
cask 'spotify'

# Mac App Store
# mas 'Byword', id: 420212497

