# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'nvm'
brew 'postgresql'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn'
brew 'telnet'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'wget'

# Development
brew 'libmemcached'
brew 'memcached'
brew 'nginx'
brew 'pyenv' # python version manager
brew 'redis'
brew 'warrensbox/tap/tfswitch' # terraform version manager

# Apps
cask '1password'
cask 'adobe-acrobat-reader'
cask 'brackets'
cask 'docker'
cask 'dropbox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'jetbrains-toolbox'
cask 'microsoft-office'
cask 'notion'
cask 'postman'
cask 'shift'
cask 'spotify'
cask 'visual-studio-code'
cask 'zoomus'
